In [8]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from matplotlib import pyplot as plt
import akshare as ak

s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.923376  1.000180 -0.602922 -1.697992
2013-01-02 -1.324065  1.113714  1.236920  0.527493
2013-01-03  0.422448 -0.476417  0.356505  1.096552
2013-01-04 -0.912078  0.905802 -0.817968  0.265594
2013-01-05 -0.659788  0.233923  1.886259 -1.021380
2013-01-06  0.201642  1.122724 -0.071453  0.283305

In [10]:
df[(df.A>=0.1)&(df.D>1)]

                   A         B         C         D
2013-01-03  0.422448 -0.476417  0.356505  1.096552

In [11]:
df.sort_values(["A"],ascending=False)

                   A         B         C         D
2013-01-01  1.923376  1.000180 -0.602922 -1.697992
2013-01-03  0.422448 -0.476417  0.356505  1.096552
2013-01-06  0.201642  1.122724 -0.071453  0.283305
2013-01-05 -0.659788  0.233923  1.886259 -1.021380
2013-01-04 -0.912078  0.905802 -0.817968  0.265594
2013-01-02 -1.324065  1.113714  1.236920  0.527493

In [12]:
# 疫情数据
covid_19_163_data=ak.covid_19_163(indicator="世界历史累计数据")
covid_19_163_data.loc['日本']

数据更新时间: 2020-04-15 09:35:44

confirm    8885.0
suspect       0.0
heal       1497.0
dead        174.0
severe        0.0
input         NaN
Name: 日本, dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data.fillna(0,inplace=True)
data.replace(0,1.11)

      0     1     2
0  1.00  6.50  3.00
1  1.00  1.11  1.11
2  1.11  1.11  1.11
3  1.11  6.50  3.00